tutorials/fluidSolidInteraction/flexibleDamBreak/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com](https://www.openfoam.com), and owner of the  |
|              OPENFOAM® and OpenCFD® trade marks.                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//fluidSolidInterface    fixedRelaxation;
fluidSolidInterface    Aitken;
//fluidSolidInterface    IQNILS;

fixedRelaxationCoeffs
{
    solidPatch interface;

    fluidPatch interface;

    relaxationFactor 0.4;

    interfaceDeformationLimit 0;

    outerCorrTolerance 1e-6;
    nOuterCorr 20;

    interpolatorUpdateFrequency 0;

    // couplingReuse 0;

    coupled yes;
}

AitkenCoeffs
{
    solidPatch interface;
    solidZone interface-zone;

    fluidPatch interface;
    fluidZone interface-zone;

    relaxationFactor 0.4;

    interfaceDeformationLimit 0;

    outerCorrTolerance 1e-6;
    nOuterCorr 20;

    interpolatorUpdateFrequency 0;

    // couplingReuse 0;

    coupled yes;
}

IQNILSCoeffs
{
    solidPatch interface;
    solidZone interface-zone;

    fluidPatch interface;
    fluidZone interface-zone;

    relaxationFactor 0.4;

    interfaceDeformationLimit 0;

    outerCorrTolerance 1e-6;
    nOuterCorr 20;

    interpolatorUpdateFrequency 0;

    couplingReuse 0;

    coupled yes;
}

// ************************************************************************* //
