tutorials/fluidSolidInteraction/flexibleDamBreak/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com](https://www.openfoam.com), and owner of the  |
|              OPENFOAM® and OpenCFD® trade marks.                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

mechanical
(
    flexibleMaterial
    {
        type        linearElastic;
        rho         rho [1 -3 0 0 0 0 0] 8000;
        E           E [1 -1 -2 0 0 0 0] 0.2e6;
        nu          nu [0 0 0 0 0 0 0] 0.3;
    }
);

// ************************************************************************* //
